{"format": "graph-model", "generatedBy": "2.16.1", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"inputs": {"name": "inputs:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "21"}, {"size": "3"}, {"size": "2"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "26"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/wide_residual_1/flatten_1/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_1/fc_residual_1/dense_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "126"}, {"size": "126"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_1/fc_residual_1/dense_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "126"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_1/fc_residual_1/dense_1_2/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "126"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_1/fc_residual_1/dense_1_2/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_1/fc_residual_1/dense_2_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "126"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_1/fc_residual_1/dense_2_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "126"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_1/fc_residual_1_2/dense_3_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "126"}, {"size": "126"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_1/fc_residual_1_2/dense_3_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "126"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_1/fc_residual_1_2/dense_4_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "126"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_1/fc_residual_1_2/dense_4_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_1/fc_residual_1_2/dense_5_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "126"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_1/fc_residual_1_2/dense_5_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "126"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/flatten_3/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_1_2/fc_residual_2_1/dense_6_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "63"}, {"size": "63"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_1_2/fc_residual_2_1/dense_6_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "63"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_1_2/fc_residual_2_1/dense_7_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "63"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_1_2/fc_residual_2_1/dense_7_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_1_2/fc_residual_2_1/dense_8_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "63"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_1_2/fc_residual_2_1/dense_8_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "63"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_1_2/fc_residual_3_1/dense_9_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "63"}, {"size": "63"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_1_2/fc_residual_3_1/dense_9_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "63"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_1_2/fc_residual_3_1/dense_10_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "63"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_1_2/fc_residual_3_1/dense_10_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_1_2/fc_residual_3_1/dense_11_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "63"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_1_2/fc_residual_3_1/dense_11_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "63"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/flatten_5/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_2_1/fc_residual_4_1/dense_12_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "63"}, {"size": "63"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_2_1/fc_residual_4_1/dense_12_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "63"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_2_1/fc_residual_4_1/dense_13_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "63"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_2_1/fc_residual_4_1/dense_13_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_2_1/fc_residual_4_1/dense_14_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "63"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_2_1/fc_residual_4_1/dense_14_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "63"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_2_1/fc_residual_5_1/dense_15_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "63"}, {"size": "63"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_2_1/fc_residual_5_1/dense_15_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "63"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_2_1/fc_residual_5_1/dense_16_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "63"}, {"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_2_1/fc_residual_5_1/dense_16_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_2_1/fc_residual_5_1/dense_17_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "63"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_2_1/fc_residual_5_1/dense_17_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "63"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/concatenate_1/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_3_1/fc_residual_6_1/dense_18_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "252"}, {"size": "252"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_3_1/fc_residual_6_1/dense_18_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "252"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_3_1/fc_residual_6_1/dense_19_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "252"}, {"size": "504"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_3_1/fc_residual_6_1/dense_19_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "504"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_3_1/fc_residual_6_1/dense_20_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "504"}, {"size": "252"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_3_1/fc_residual_6_1/dense_20_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "252"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/dense_21_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "252"}, {"size": "26"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/dense_21_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "26"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "inputs", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "21"}, {"size": "3"}, {"size": "2"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/flatten_1/Reshape", "op": "Reshape", "input": ["inputs", "StatefulPartitionedCall/wide_residual_1/flatten_1/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/strided_slice_1", "op": "StridedSlice", "input": ["inputs", "StatefulPartitionedCall/wide_residual_1/strided_slice_1/stack", "StatefulPartitionedCall/wide_residual_1/strided_slice_1/stack_1", "StatefulPartitionedCall/wide_residual_1/strided_slice_1/stack_2"], "attr": {"shrink_axis_mask": {"i": "8"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "7"}, "T": {"type": "DT_FLOAT"}, "end_mask": {"i": "7"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/strided_slice", "op": "StridedSlice", "input": ["inputs", "StatefulPartitionedCall/wide_residual_1/strided_slice/stack", "StatefulPartitionedCall/wide_residual_1/strided_slice/stack_1", "StatefulPartitionedCall/wide_residual_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "8"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "7"}, "T": {"type": "DT_FLOAT"}, "end_mask": {"i": "7"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_1/fc_residual_1/leaky_re_lu_1/LeakyRelu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/wide_residual_1/flatten_1/Reshape", "StatefulPartitionedCall/wide_residual_1/sequential_1/fc_residual_1/dense_1/Cast/ReadVariableOp", "StatefulPartitionedCall/wide_residual_1/sequential_1/fc_residual_1/dense_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "leakyrelu_alpha": {"f": 0.3}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/flatten_5/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/wide_residual_1/strided_slice_1", "StatefulPartitionedCall/wide_residual_1/flatten_5/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/flatten_3/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/wide_residual_1/strided_slice", "StatefulPartitionedCall/wide_residual_1/flatten_3/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_1/fc_residual_1/leaky_re_lu_1_2/LeakyRelu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/wide_residual_1/sequential_1/fc_residual_1/leaky_re_lu_1/LeakyRelu", "StatefulPartitionedCall/wide_residual_1/sequential_1/fc_residual_1/dense_1_2/Cast/ReadVariableOp", "StatefulPartitionedCall/wide_residual_1/sequential_1/fc_residual_1/dense_1_2/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "leakyrelu_alpha": {"f": 0.3}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_2_1/fc_residual_4_1/leaky_re_lu_12_1/LeakyRelu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/wide_residual_1/flatten_5/Reshape", "StatefulPartitionedCall/wide_residual_1/sequential_2_1/fc_residual_4_1/dense_12_1/Cast/ReadVariableOp", "StatefulPartitionedCall/wide_residual_1/sequential_2_1/fc_residual_4_1/dense_12_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "leakyrelu_alpha": {"f": 0.3}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_1_2/fc_residual_2_1/leaky_re_lu_6_1/LeakyRelu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/wide_residual_1/flatten_3/Reshape", "StatefulPartitionedCall/wide_residual_1/sequential_1_2/fc_residual_2_1/dense_6_1/Cast/ReadVariableOp", "StatefulPartitionedCall/wide_residual_1/sequential_1_2/fc_residual_2_1/dense_6_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "leakyrelu_alpha": {"f": 0.3}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_1/fc_residual_1/leaky_re_lu_2_1/LeakyRelu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/wide_residual_1/sequential_1/fc_residual_1/leaky_re_lu_1_2/LeakyRelu", "StatefulPartitionedCall/wide_residual_1/sequential_1/fc_residual_1/dense_2_1/Cast/ReadVariableOp", "StatefulPartitionedCall/wide_residual_1/sequential_1/fc_residual_1/dense_2_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "leakyrelu_alpha": {"f": 0.3}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_2_1/fc_residual_4_1/leaky_re_lu_13_1/LeakyRelu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/wide_residual_1/sequential_2_1/fc_residual_4_1/leaky_re_lu_12_1/LeakyRelu", "StatefulPartitionedCall/wide_residual_1/sequential_2_1/fc_residual_4_1/dense_13_1/Cast/ReadVariableOp", "StatefulPartitionedCall/wide_residual_1/sequential_2_1/fc_residual_4_1/dense_13_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "leakyrelu_alpha": {"f": 0.3}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_1_2/fc_residual_2_1/leaky_re_lu_7_1/LeakyRelu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/wide_residual_1/sequential_1_2/fc_residual_2_1/leaky_re_lu_6_1/LeakyRelu", "StatefulPartitionedCall/wide_residual_1/sequential_1_2/fc_residual_2_1/dense_7_1/Cast/ReadVariableOp", "StatefulPartitionedCall/wide_residual_1/sequential_1_2/fc_residual_2_1/dense_7_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "leakyrelu_alpha": {"f": 0.3}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_1/fc_residual_1/add_1/Add", "op": "AddV2", "input": ["StatefulPartitionedCall/wide_residual_1/flatten_1/Reshape", "StatefulPartitionedCall/wide_residual_1/sequential_1/fc_residual_1/leaky_re_lu_2_1/LeakyRelu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_2_1/fc_residual_4_1/leaky_re_lu_14_1/LeakyRelu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/wide_residual_1/sequential_2_1/fc_residual_4_1/leaky_re_lu_13_1/LeakyRelu", "StatefulPartitionedCall/wide_residual_1/sequential_2_1/fc_residual_4_1/dense_14_1/Cast/ReadVariableOp", "StatefulPartitionedCall/wide_residual_1/sequential_2_1/fc_residual_4_1/dense_14_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "leakyrelu_alpha": {"f": 0.3}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_1_2/fc_residual_2_1/leaky_re_lu_8_1/LeakyRelu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/wide_residual_1/sequential_1_2/fc_residual_2_1/leaky_re_lu_7_1/LeakyRelu", "StatefulPartitionedCall/wide_residual_1/sequential_1_2/fc_residual_2_1/dense_8_1/Cast/ReadVariableOp", "StatefulPartitionedCall/wide_residual_1/sequential_1_2/fc_residual_2_1/dense_8_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.3}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_1/fc_residual_1_2/leaky_re_lu_3_1/LeakyRelu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/wide_residual_1/sequential_1/fc_residual_1/add_1/Add", "StatefulPartitionedCall/wide_residual_1/sequential_1/fc_residual_1_2/dense_3_1/Cast/ReadVariableOp", "StatefulPartitionedCall/wide_residual_1/sequential_1/fc_residual_1_2/dense_3_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "leakyrelu_alpha": {"f": 0.3}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_2_1/fc_residual_4_1/add_4_1/Add", "op": "AddV2", "input": ["StatefulPartitionedCall/wide_residual_1/flatten_5/Reshape", "StatefulPartitionedCall/wide_residual_1/sequential_2_1/fc_residual_4_1/leaky_re_lu_14_1/LeakyRelu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_1_2/fc_residual_2_1/add_2_1/Add", "op": "AddV2", "input": ["StatefulPartitionedCall/wide_residual_1/flatten_3/Reshape", "StatefulPartitionedCall/wide_residual_1/sequential_1_2/fc_residual_2_1/leaky_re_lu_8_1/LeakyRelu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_1/fc_residual_1_2/leaky_re_lu_4_1/LeakyRelu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/wide_residual_1/sequential_1/fc_residual_1_2/leaky_re_lu_3_1/LeakyRelu", "StatefulPartitionedCall/wide_residual_1/sequential_1/fc_residual_1_2/dense_4_1/Cast/ReadVariableOp", "StatefulPartitionedCall/wide_residual_1/sequential_1/fc_residual_1_2/dense_4_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "leakyrelu_alpha": {"f": 0.3}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_2_1/fc_residual_5_1/leaky_re_lu_15_1/LeakyRelu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/wide_residual_1/sequential_2_1/fc_residual_4_1/add_4_1/Add", "StatefulPartitionedCall/wide_residual_1/sequential_2_1/fc_residual_5_1/dense_15_1/Cast/ReadVariableOp", "StatefulPartitionedCall/wide_residual_1/sequential_2_1/fc_residual_5_1/dense_15_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.3}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_1_2/fc_residual_3_1/leaky_re_lu_9_1/LeakyRelu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/wide_residual_1/sequential_1_2/fc_residual_2_1/add_2_1/Add", "StatefulPartitionedCall/wide_residual_1/sequential_1_2/fc_residual_3_1/dense_9_1/Cast/ReadVariableOp", "StatefulPartitionedCall/wide_residual_1/sequential_1_2/fc_residual_3_1/dense_9_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.3}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_1/fc_residual_1_2/leaky_re_lu_5_1/LeakyRelu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/wide_residual_1/sequential_1/fc_residual_1_2/leaky_re_lu_4_1/LeakyRelu", "StatefulPartitionedCall/wide_residual_1/sequential_1/fc_residual_1_2/dense_5_1/Cast/ReadVariableOp", "StatefulPartitionedCall/wide_residual_1/sequential_1/fc_residual_1_2/dense_5_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.3}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_2_1/fc_residual_5_1/leaky_re_lu_16_1/LeakyRelu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/wide_residual_1/sequential_2_1/fc_residual_5_1/leaky_re_lu_15_1/LeakyRelu", "StatefulPartitionedCall/wide_residual_1/sequential_2_1/fc_residual_5_1/dense_16_1/Cast/ReadVariableOp", "StatefulPartitionedCall/wide_residual_1/sequential_2_1/fc_residual_5_1/dense_16_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "leakyrelu_alpha": {"f": 0.3}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_1_2/fc_residual_3_1/leaky_re_lu_10_1/LeakyRelu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/wide_residual_1/sequential_1_2/fc_residual_3_1/leaky_re_lu_9_1/LeakyRelu", "StatefulPartitionedCall/wide_residual_1/sequential_1_2/fc_residual_3_1/dense_10_1/Cast/ReadVariableOp", "StatefulPartitionedCall/wide_residual_1/sequential_1_2/fc_residual_3_1/dense_10_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.3}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_1/fc_residual_1_2/add_1_1/Add", "op": "AddV2", "input": ["StatefulPartitionedCall/wide_residual_1/sequential_1/fc_residual_1/add_1/Add", "StatefulPartitionedCall/wide_residual_1/sequential_1/fc_residual_1_2/leaky_re_lu_5_1/LeakyRelu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_2_1/fc_residual_5_1/leaky_re_lu_17_1/LeakyRelu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/wide_residual_1/sequential_2_1/fc_residual_5_1/leaky_re_lu_16_1/LeakyRelu", "StatefulPartitionedCall/wide_residual_1/sequential_2_1/fc_residual_5_1/dense_17_1/Cast/ReadVariableOp", "StatefulPartitionedCall/wide_residual_1/sequential_2_1/fc_residual_5_1/dense_17_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "leakyrelu_alpha": {"f": 0.3}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_1_2/fc_residual_3_1/leaky_re_lu_11_1/LeakyRelu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/wide_residual_1/sequential_1_2/fc_residual_3_1/leaky_re_lu_10_1/LeakyRelu", "StatefulPartitionedCall/wide_residual_1/sequential_1_2/fc_residual_3_1/dense_11_1/Cast/ReadVariableOp", "StatefulPartitionedCall/wide_residual_1/sequential_1_2/fc_residual_3_1/dense_11_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "leakyrelu_alpha": {"f": 0.3}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_2_1/fc_residual_5_1/add_5_1/Add", "op": "AddV2", "input": ["StatefulPartitionedCall/wide_residual_1/sequential_2_1/fc_residual_4_1/add_4_1/Add", "StatefulPartitionedCall/wide_residual_1/sequential_2_1/fc_residual_5_1/leaky_re_lu_17_1/LeakyRelu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_1_2/fc_residual_3_1/add_3_1/Add", "op": "AddV2", "input": ["StatefulPartitionedCall/wide_residual_1/sequential_1_2/fc_residual_2_1/add_2_1/Add", "StatefulPartitionedCall/wide_residual_1/sequential_1_2/fc_residual_3_1/leaky_re_lu_11_1/LeakyRelu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/concatenate_1/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/wide_residual_1/sequential_1/fc_residual_1_2/add_1_1/Add", "StatefulPartitionedCall/wide_residual_1/sequential_1_2/fc_residual_3_1/add_3_1/Add", "StatefulPartitionedCall/wide_residual_1/sequential_2_1/fc_residual_5_1/add_5_1/Add", "StatefulPartitionedCall/wide_residual_1/concatenate_1/concat/axis"], "attr": {"N": {"i": "3"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_3_1/fc_residual_6_1/leaky_re_lu_18_1/LeakyRelu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/wide_residual_1/concatenate_1/concat", "StatefulPartitionedCall/wide_residual_1/sequential_3_1/fc_residual_6_1/dense_18_1/Cast/ReadVariableOp", "StatefulPartitionedCall/wide_residual_1/sequential_3_1/fc_residual_6_1/dense_18_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "leakyrelu_alpha": {"f": 0.3}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_3_1/fc_residual_6_1/leaky_re_lu_19_1/LeakyRelu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/wide_residual_1/sequential_3_1/fc_residual_6_1/leaky_re_lu_18_1/LeakyRelu", "StatefulPartitionedCall/wide_residual_1/sequential_3_1/fc_residual_6_1/dense_19_1/Cast/ReadVariableOp", "StatefulPartitionedCall/wide_residual_1/sequential_3_1/fc_residual_6_1/dense_19_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.3}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_3_1/fc_residual_6_1/leaky_re_lu_20_1/LeakyRelu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/wide_residual_1/sequential_3_1/fc_residual_6_1/leaky_re_lu_19_1/LeakyRelu", "StatefulPartitionedCall/wide_residual_1/sequential_3_1/fc_residual_6_1/dense_20_1/Cast/ReadVariableOp", "StatefulPartitionedCall/wide_residual_1/sequential_3_1/fc_residual_6_1/dense_20_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "TGVha3lSZWx1"]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.3}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_3_1/fc_residual_6_1/add_6_1/Add", "op": "AddV2", "input": ["StatefulPartitionedCall/wide_residual_1/concatenate_1/concat", "StatefulPartitionedCall/wide_residual_1/sequential_3_1/fc_residual_6_1/leaky_re_lu_20_1/LeakyRelu"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/wide_residual_1/dense_21_1/Add", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/wide_residual_1/sequential_3_1/fc_residual_6_1/add_6_1/Add", "StatefulPartitionedCall/wide_residual_1/dense_21_1/Cast/ReadVariableOp", "StatefulPartitionedCall/wide_residual_1/dense_21_1/Add/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/wide_residual_1/dense_21_1/Add"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1766}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/wide_residual_1/flatten_1/Reshape/shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_1/fc_residual_1/dense_1/Cast/ReadVariableOp", "shape": [126, 126], "dtype": "float32"}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_1/fc_residual_1/dense_1/Add/ReadVariableOp", "shape": [126], "dtype": "float32"}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_1/fc_residual_1/dense_1_2/Cast/ReadVariableOp", "shape": [126, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_1/fc_residual_1/dense_1_2/Add/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_1/fc_residual_1/dense_2_1/Cast/ReadVariableOp", "shape": [256, 126], "dtype": "float32"}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_1/fc_residual_1/dense_2_1/Add/ReadVariableOp", "shape": [126], "dtype": "float32"}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_1/fc_residual_1_2/dense_3_1/Cast/ReadVariableOp", "shape": [126, 126], "dtype": "float32"}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_1/fc_residual_1_2/dense_3_1/Add/ReadVariableOp", "shape": [126], "dtype": "float32"}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_1/fc_residual_1_2/dense_4_1/Cast/ReadVariableOp", "shape": [126, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_1/fc_residual_1_2/dense_4_1/Add/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_1/fc_residual_1_2/dense_5_1/Cast/ReadVariableOp", "shape": [256, 126], "dtype": "float32"}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_1/fc_residual_1_2/dense_5_1/Add/ReadVariableOp", "shape": [126], "dtype": "float32"}, {"name": "StatefulPartitionedCall/wide_residual_1/strided_slice/stack", "shape": [4], "dtype": "int32"}, {"name": "StatefulPartitionedCall/wide_residual_1/strided_slice/stack_1", "shape": [4], "dtype": "int32"}, {"name": "StatefulPartitionedCall/wide_residual_1/strided_slice/stack_2", "shape": [4], "dtype": "int32"}, {"name": "StatefulPartitionedCall/wide_residual_1/flatten_3/Reshape/shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_1_2/fc_residual_2_1/dense_6_1/Cast/ReadVariableOp", "shape": [63, 63], "dtype": "float32"}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_1_2/fc_residual_2_1/dense_6_1/Add/ReadVariableOp", "shape": [63], "dtype": "float32"}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_1_2/fc_residual_2_1/dense_7_1/Cast/ReadVariableOp", "shape": [63, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_1_2/fc_residual_2_1/dense_7_1/Add/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_1_2/fc_residual_2_1/dense_8_1/Cast/ReadVariableOp", "shape": [256, 63], "dtype": "float32"}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_1_2/fc_residual_2_1/dense_8_1/Add/ReadVariableOp", "shape": [63], "dtype": "float32"}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_1_2/fc_residual_3_1/dense_9_1/Cast/ReadVariableOp", "shape": [63, 63], "dtype": "float32"}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_1_2/fc_residual_3_1/dense_9_1/Add/ReadVariableOp", "shape": [63], "dtype": "float32"}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_1_2/fc_residual_3_1/dense_10_1/Cast/ReadVariableOp", "shape": [63, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_1_2/fc_residual_3_1/dense_10_1/Add/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_1_2/fc_residual_3_1/dense_11_1/Cast/ReadVariableOp", "shape": [256, 63], "dtype": "float32"}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_1_2/fc_residual_3_1/dense_11_1/Add/ReadVariableOp", "shape": [63], "dtype": "float32"}, {"name": "StatefulPartitionedCall/wide_residual_1/strided_slice_1/stack", "shape": [4], "dtype": "int32"}, {"name": "StatefulPartitionedCall/wide_residual_1/strided_slice_1/stack_1", "shape": [4], "dtype": "int32"}, {"name": "StatefulPartitionedCall/wide_residual_1/strided_slice_1/stack_2", "shape": [4], "dtype": "int32"}, {"name": "StatefulPartitionedCall/wide_residual_1/flatten_5/Reshape/shape", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_2_1/fc_residual_4_1/dense_12_1/Cast/ReadVariableOp", "shape": [63, 63], "dtype": "float32"}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_2_1/fc_residual_4_1/dense_12_1/Add/ReadVariableOp", "shape": [63], "dtype": "float32"}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_2_1/fc_residual_4_1/dense_13_1/Cast/ReadVariableOp", "shape": [63, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_2_1/fc_residual_4_1/dense_13_1/Add/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_2_1/fc_residual_4_1/dense_14_1/Cast/ReadVariableOp", "shape": [256, 63], "dtype": "float32"}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_2_1/fc_residual_4_1/dense_14_1/Add/ReadVariableOp", "shape": [63], "dtype": "float32"}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_2_1/fc_residual_5_1/dense_15_1/Cast/ReadVariableOp", "shape": [63, 63], "dtype": "float32"}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_2_1/fc_residual_5_1/dense_15_1/Add/ReadVariableOp", "shape": [63], "dtype": "float32"}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_2_1/fc_residual_5_1/dense_16_1/Cast/ReadVariableOp", "shape": [63, 256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_2_1/fc_residual_5_1/dense_16_1/Add/ReadVariableOp", "shape": [256], "dtype": "float32"}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_2_1/fc_residual_5_1/dense_17_1/Cast/ReadVariableOp", "shape": [256, 63], "dtype": "float32"}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_2_1/fc_residual_5_1/dense_17_1/Add/ReadVariableOp", "shape": [63], "dtype": "float32"}, {"name": "StatefulPartitionedCall/wide_residual_1/concatenate_1/concat/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_3_1/fc_residual_6_1/dense_18_1/Cast/ReadVariableOp", "shape": [252, 252], "dtype": "float32"}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_3_1/fc_residual_6_1/dense_18_1/Add/ReadVariableOp", "shape": [252], "dtype": "float32"}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_3_1/fc_residual_6_1/dense_19_1/Cast/ReadVariableOp", "shape": [252, 504], "dtype": "float32"}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_3_1/fc_residual_6_1/dense_19_1/Add/ReadVariableOp", "shape": [504], "dtype": "float32"}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_3_1/fc_residual_6_1/dense_20_1/Cast/ReadVariableOp", "shape": [504, 252], "dtype": "float32"}, {"name": "StatefulPartitionedCall/wide_residual_1/sequential_3_1/fc_residual_6_1/dense_20_1/Add/ReadVariableOp", "shape": [252], "dtype": "float32"}, {"name": "StatefulPartitionedCall/wide_residual_1/dense_21_1/Cast/ReadVariableOp", "shape": [252, 26], "dtype": "float32"}, {"name": "StatefulPartitionedCall/wide_residual_1/dense_21_1/Add/ReadVariableOp", "shape": [26], "dtype": "float32"}]}]}